Repository: AlanJAS/turtleart
Catalog: po/*.po
Languages: mg, ur

source: Turtle Art
mg: Zava-kanton'ny Sokatra (Turtle Art)
ur: کچھوا گيم

source: title
mg: lohateny
ur: ٹائيٹل

source: text
mg: lahatsoratra
ur: ٹيکسٹ

source: stack
mg: staka (stack)
ur: سٹيک

source: box
mg: boaty
ur: ڈبا

source: name
mg: anarana
ur: نام

source: Project
mg: Tetikasa
ur: پراجیکٹ

source: Save as
mg: Tehirizo ho
ur: اس طرح مہفوظ کريں

source: hide palette
mg: afeno ny andian-doko
ur: پيليٹ کو چھپائيں

source: hide blocks
mg: afeno ny vongana
ur: بلاک کو چھپائيں

source: run
mg: alefa
ur: بھاگو

source: step
mg: dingana
ur: قدم

source: stop turtle
mg: ajanony i sokatra
ur: ٹرٹل کو روک ديں

source: samples
mg: santionany
ur: نمونے

source: save as HTML
mg: tehirizo ho HTML
ur: HTMLمہفوظ کريں

source: save Logo
mg: tehirizo ny sary famantarana
ur: لوگو کو محفوظ کريں

source: load my block
mg: alaivo ny bolongako
ur: ميرے بلاک کو لوڈ کريں

source: show palette
mg: asehoy ny andian-doko
ur: پيليٹ کو ظاہر کريں

source: show blocks
mg: asehoy ireo bolongana
ur: بلاک کو ظاہر کريں

source: Flow
mg: Koriana
ur: بہنا

source: forever
mg: mandrakizay
ur: ہمیشہ کے لیے

source: if
mg: raha
ur: اگر

source: then
mg: noho izany
ur: پھر

source: else
mg: raha tsy izany
ur: زائد

source: repeat
mg: avereno
ur: دھرائیں

source: stop stack
mg: ajanony ny andiany
ur: ذخیرہ کرنے سے روکیں

source: wait
mg: andraso
ur: انتظار کریں

source: My Blocks
mg: Ny bolongako
ur: میرے خانے

source: box 1
mg: vata 1
ur: ڈبہ 1

source: box 2
mg: vata 2
ur: ڈبہ 2

source: stack 1
mg: andiany 1
ur: ذخیرہ کرنا 1

source: stack 2
mg: andiany 2
ur: ذخیرہ کرنا 2

source: store in box 1
mg: ampidiro ao anaty vata 1
ur: ڈبہ 1 میں ذخیرہ کرنا

source: store in box 2
mg: ampidiro ao anaty vata 2
ur: ڈبہ 2 میں ذخیرہ کرنا

source: push
mg: atoseho
ur: دھکا دو

source: pop
mg: avoahay
ur: پوپ

source: Numbers
mg: Tarehimarika maromaro
ur: اعداد

source: number
mg: tarehimarika
ur: عدد

source: and
mg: sy
ur: اور

source: or
mg: na
ur: یا

source: not
mg: tsy
ur: نہیں

source: random
ur: ترتیب

source: min
mg: farafahakeliny
ur: کم سے کم

source: max
mg: farafahabetsany
ur: زیادہ سے زیادہ

source: mod
ur: متوازن

source: print
mg: soraty masinina
ur: چھاپنا

source: Pen
mg: Penina
ur: قلم

source: color
mg: loko
ur: رنگ

source: shade
mg: matroka
ur: سایہ

source: fill screen
mg: fenoy ny efi-jery
ur: سکرین کو بھریں

source: pen up
mg: aingao ny penina
ur: قلم ہٹانا

source: pen down
mg: ampidino ny penina
ur: قلم رکھنا

source: set pen size
mg: omeo ny refin'ny penina
ur: قلم کا سائز درست کرنا

source: pen size
mg: refin'ny penina
ur: قلم کا سائز

source: set shade
mg: asio tandindona
ur: سایہ کو درست کرنا

source: set color
mg: asio loko
ur: رنگ کو درست کرنا

source: set text color
mg: omeo ny loko'ny lahatsoratra
ur: متن کا رنگ سيٹ کريں

source: Blocks
mg: Bolongana
ur: خانے

source: Turtle
mg: Sokatra
ur: کچھوا

source: clean
mg: diovy
ur: صاف

source: forward
mg: mandrosoa
ur: آگے

source: back
mg: mihemora
ur: واپس

source: right
mg: ankavanana
ur: دایاں

source: left
mg: ankavia
ur: بایاں

source: arc
mg: faribolana
ur: کمان

source: angle
mg: zoro
ur: ذاویہ

source: radius
mg: tana
ur: نصف قطر

source: heading
mg: lohateny
ur: عنوان

source: set heading
mg: omeo lohateny
ur: عنوان کو سيٹ کريں

source: set xy
mg: omeo ny xy
ur: xy درست کریں

source: Sensors
mg: Mpanambolo (Mpandray)
ur: سينسرز

source: volume
mg: hadiry
ur: آواز

source: pitch
mg: haavo
ur: سطح

source: voltage
mg: voltazy
ur: وولٹيج

source: resistance
ur: مزاحمت

source: Templates
mg: Takila-modely
ur: ٹمپليٹ

source: Keyboard
mg: Fitendry soratra (/Fitendry feo)
ur: کی بورڈ

source: read key
mg: vakio ny fanalahidy
ur: پڑھنے والی کی

source: sound
mg: feo
ur: آواز

source: start
mg: atomboy
ur: شروع کریں
